print("Тип данных json")
print("JavaScript Object Notation — текстовый формат данных, основанный на языке JavaScript."
      "Хорошо подходит для сериализации (перевода в биты), иногда используется для сзяви серверов  браузеров,"
      "Поддерживает следующие значения: Объект - аналог словаря; Массив - аналог списка;"
      "Числа; Лителаллы (True, False, None); Строки")

print("Тип данных xml")
print("eXtensible Markup Language — (относительно) старый и универсальный текстовый формат данных,"
      "удобный для передачи информации в Интернете."
      "Состоит из Корневого элемента (собственно файла) и, иногда,"
      "Пролога, дополнения к файлу (например инструкции)"
      "Содержит большой синтаксис")

print("Тип данных yaml")
print("Yet Another Markup Language — формат данных с одним из самых забавных названий,"
      "главной особенностью которого является удобство ввода-вывода данных, минималистичен (в отличии от hml)"
      )
