Время: 19:01
Дата: 13.03.2018

Ответ 10: [An for An in mass if m%(3*4) == 0 and m != 0]

Комментарии:
1. Без комментариев
2. Без комментариев
3. Без комментариев
4. Только глобальные константы (числа) могут записываться заглавными буквами,
   а NAME - строка, из чего можно сделать вывод, что это не константа.
5. "foo = {'A':56, 'B':77}" - отсутствуют пробелы после двоеточия,
   "my_dict = {'Great' :'Ben', 'Small :'None'}" - проблел стоит до двоеточия, а не после, и у 'Small' нет закрывающей кавычки
6. Первый ответ - вторая и остальные строчки должны начинаться в месте, перед которым на первой строке была открывающая скобка,
   а двоеточие после закрывающей скобочки делает формат переменной, как минимум, незнакомым мне;
   Второй, третий, четвертый, пятый ответы - 
   вторая строчка должна начинаться в месте, перед которым на первой строке была открывающая скобка;
   Шестой ответ - все хорошо;
   Седьмой ответ - тоже, что и второй, третий, четвертый и пятый;
   Восьмой ответ - все хорошо;
7. a = 1, - создание единичного кортежа (tuple), а не числа (int)
   a = [""] и a = (None,) - создают непустые список и кортеж, что уже достаточно для True;
8. Первый ответ - со стилистической частью кода все хорошо;
   Второй ответ - не хватает табуляции перед pass и, т.к. переменная text ссылается на эту функцию,
   то значит эта функция уже закончилась и требуется 2 пустых строки для окончания функции;
   Третий ответ - предполагается, что continue будет на следующей строке с табуляцией
   Четвертый ответ - все эти части должны быть на своих собственных строчках
   Пятый ответ - т.к. предполагается, что это часть цикла, можно обойтись без новой строки
9. Без комментариев
